Autodesk.Revit.DB.ViewPlacementOnSheetStatus
Indicates whether the View is placed on a Sheet.
Remarks:
Some Views can be placed on one or more Sheets completely or partially.
For example, a Schedule divided in segments, and only some of them are placed on Sheets.
Since:
2023

Autodesk.Revit.DB.ViewPlacementOnSheetStatus.CompletelyPlaced
The View is completely placed on a Sheet.

Autodesk.Revit.DB.ViewPlacementOnSheetStatus.PartiallyPlaced
The View is partially placed on a Sheet.

Autodesk.Revit.DB.ViewPlacementOnSheetStatus.NotPlaced
The View is not placed on a Sheet.

Autodesk.Revit.DB.ViewPlacementOnSheetStatus.NotApplicable
The View cannot be placed on Sheet.